blog-posts/2005-10-24-aha-moment-43-emacsen-feel-free-to-steal-this-idea.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Aha! moment &#x2014; 43 Emacsen &#x2014; feel free to steal this idea! =)</title>
<!-- 2015-01-07 Wed 14:57 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Aha! moment &#x2014; 43 Emacsen &#x2014; feel free to steal this idea! =)</h1>
<p>
October 24th, 2005 -
<a href="http://sachachua.com/blog/p/3097"><a href="http://sachachua.com/blog/p/3097">http://sachachua.com/blog/p/3097</a></a>
</p>

<p>
Feel free to Make This Happen, or get in touch with me if you want to
 hack on this with a Ruby/Rails newbie. =)
</p>

<p>
You know how geeks do \<sub>really\</sub>_ crazy things with their favorite
 applications? Like the way I practically live in Emacs? And the way
 some people practically live in Microsoft Excel? We use applications
 for \<sub>far\</sub>_ more than they were originally imagined to do.
</p>

<p>
So let's help people think out of the box. Let's show them what geeks
 push their applications to do.
</p>

<p>
What would be ultracool?
</p>

<p>
Think of the way <a href="http://www.43things.com">43things</a> lets you say
 you've either done something or you plan to do something. Add a
 software context and support screenshots. For example, you could add
 “Do mail” to your list of things, set “Emacs” as your software, and
 post a screenshot (optional) of Gnus (or even Rmail). Tick a little
 checkbox if you don't mind if people to ask you for help, and add a
 short note about your experience if you want&#x2026; Oooh, and throw
 tagging in there somewhere.
</p>

<p>
Why is this ubercool?
</p>

<ul class="org-ul">
<li>You see what other people do with a certain application. (And you
</li>
</ul>

<blockquote>
<p>
will begin to appreciate the insane flexibility of the Emacs text
 editor!)
</p>
</blockquote>

<ul class="org-ul">
<li>You see how other people do something, and maybe even how popular
</li>
</ul>

<blockquote>
<p>
something is.
</p>
</blockquote>

<ul class="org-ul">
<li>You see what friends and similar people use. =)
</li>
</ul>

<p>
I want this. I think it would totally rock. I'm crazier about it than
 the Eclipse snippets project my research supervisor wants me to
 consider. I think we might get all sorts of useful data about geek
 program usage, if we can get people to do this. For example, I'd
 \<sub>love\</sub>_ to find out what other crazy geek things people who have
 similar usage patterns for Emacs might be doing, or what other
 applications they're crazy about&#x2026; For example, I'm crazy about
 Mozilla Firefox&#x2014;but I know people out there are doing even cooler
 things with it!
</p>

<p>
Steal this idea. Run with it. Make it happen. If I can use it for free
 and I can copy my data easily, I'll be one of your first users and
evangelists! =)
</p>

<hr  />

<p>
Tracing the thoughtpath for fun: how did I get to thinking about that?
</p>

<ol class="org-ol">
<li>Well, I was thinking about Google and how I want to be an evangelist
more than I want to be an engineer.
</li>
<li>Then I thought about evangelism and what I usually get excited
about.
</li>
<li>Which naturally made me think about Emacs.
</li>
<li>So I thought about all the crazy stuff you can do with Emacs.
</li>
<li>And then I thought about Danny O' Brien's lifehacks talk and how
power users do crazy things with applications.
</li>
<li>Which made me wonder what other people are doing with Emacs.
</li>
<li>Which made me want to start a blog (or revive emacstidbits).
</li>
<li>&#x2026; but then I wanted to see \<sub>other\</sub>_ people's stories&#x2026;
</li>
<li>&#x2026; and although some stories are on
<a href="http://www.emacswiki.org"><a href="http://www.emacswiki.org">http://www.emacswiki.org</a></a> , they're
still
 buried in technical information&#x2026;
</li>
<li>&#x2026; so wouldn't it be cool if we could bring those stories out and
make them

<blockquote>
<p>
easy to capture and browse?
</p>
</blockquote>
</li>

<li>Which made me think of other services that did that, like 43things.
</li>
<li>Which gave me that aha! moment!
</li>
</ol>

<p>
N degrees of Sacha Chua's mind. Emacs is my Kevin Bacon. ;)
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
